WestianPKl/Logger_Dashboard/logger/STM32/STM32F412RGT6/rtos/include/FreeRTOSConfig.h
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#ifdef __ICCARM__
#include <stdint.h>
#endif

#include "stm32f4xx.h"
extern uint32_t SystemCoreClock;

#define configSUPPORT_STATIC_ALLOCATION 0
#define configSUPPORT_DYNAMIC_ALLOCATION 1

#define configUSE_PREEMPTION   1
#define configUSE_IDLE_HOOK    0
#define configUSE_TICK_HOOK    0
#define configCPU_CLOCK_HZ    ( SystemCoreClock )
#define configTICK_RATE_HZ    ( ( TickType_t ) 1000 )
#define configMAX_PRIORITIES   ( 5 )
#define configMINIMAL_STACK_SIZE  ( ( unsigned short ) 130 )
#define configTOTAL_HEAP_SIZE   ( ( size_t ) ( 75 * 1024 ) )
#define configMAX_TASK_NAME_LEN   ( 10 )
#define configUSE_TRACE_FACILITY  1
#define configUSE_16_BIT_TICKS   0
#define configIDLE_SHOULD_YIELD   1
#define configUSE_MUTEXES    1
#define configQUEUE_REGISTRY_SIZE  8
#define configCHECK_FOR_STACK_OVERFLOW 0
#define configUSE_RECURSIVE_MUTEXES  1
#define configUSE_MALLOC_FAILED_HOOK 0
#define configUSE_APPLICATION_TASK_TAG 0
#define configUSE_COUNTING_SEMAPHORES 1
#define configGENERATE_RUN_TIME_STATS 0

#define configUSE_CO_ROUTINES   0
#define configMAX_CO_ROUTINE_PRIORITIES ( 2 )

#define configUSE_TIMERS    1
#define configTIMER_TASK_PRIORITY  ( 2 )
#define configTIMER_QUEUE_LENGTH  10
#define configTIMER_TASK_STACK_DEPTH ( configMINIMAL_STACK_SIZE * 2 )

#define INCLUDE_vTaskPrioritySet  1
#define INCLUDE_uxTaskPriorityGet  1
#define INCLUDE_vTaskDelete    1
#define INCLUDE_vTaskCleanUpResources 1
#define INCLUDE_vTaskSuspend   1
#define INCLUDE_vTaskDelayUntil   1
#define INCLUDE_vTaskDelay    1

#ifdef __NVIC_PRIO_BITS
#define configPRIO_BITS         __NVIC_PRIO_BITS
#else
#define configPRIO_BITS         4 
#endif
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY   0xf
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 5

#define configKERNEL_INTERRUPT_PRIORITY   ( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
#define configMAX_SYSCALL_INTERRUPT_PRIORITY  ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )

#define configASSERT( x ) if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); for( ;; ); }

#define vPortSVCHandler SVC_Handler
#define xPortPendSVHandler PendSV_Handler
#define xPortSysTickHandler SysTick_Handler

#endif /* FREERTOS_CONFIG_H */